# CanAddGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..CanAddGeometry Method
BRepBuilder Class See Also
---
A validator function that checks the state of this BRepBuilder object. Returns true if this BRepBuilder object is accepting b-rep data, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanAddGeometry()
```

Visual Basic
---
```text
Public Function CanAddGeometry As Boolean
```

Visual C++
---
```text
public:
bool CanAddGeometry()
```

# ### Return Value
True if this BRepBuilder object is accepting b-rep data, false otherwise.
# Remarks
Use this function before calling AddFace(), AddEdge(), etc. to avoid an exception being thrown.
# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace